### 쥬피터와 SQL 연결

In [1]:
%load_ext sql

In [2]:
%sql mysql://root:1234@127.0.0.1:4000/classicmodels

In [3]:
%%sql
CREATE VIEW cancel_prodno
AS
SELECT * 
FROM ORDERS
WHERE status = 'Cancelled'

 * mysql://root:***@127.0.0.1:4000/classicmodels
(MySQLdb.OperationalError) (1050, "Table 'cancel_prodno' already exists")
[SQL: CREATE VIEW cancel_prodno
AS
SELECT *
FROM ORDERS
WHERE status = 'Cancelled']
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [4]:
%sql show tables

 * mysql://root:***@127.0.0.1:4000/classicmodels
10 rows affected.

[('cancel_prodno',),
 ('cancle_prodno',),
 ('customers',),
 ('employees',),
 ('offices',),
 ('orderdetails',),
 ('orders',),
 ('payments',),
 ('productlines',),
 ('products',)]

In [5]:
%sql desc orders

 * mysql://root:***@127.0.0.1:4000/classicmodels
7 rows affected.

[('orderNumber', 'int', 'NO', 'PRI', None, ''),
 ('orderDate', 'date', 'NO', '', None, ''),
 ('requiredDate', 'date', 'NO', '', None, ''),
 ('shippedDate', 'date', 'YES', '', None, ''),
 ('status', 'varchar(15)', 'NO', '', None, ''),
 ('comments', 'text', 'YES', '', None, ''),
 ('customerNumber', 'int', 'NO', 'MUL', None, '')]

### 일별 매출액

In [ ]:
%%sql
SELECT orderDate,
SUM(quantityOrdered*priceEach) AS SALES
FROM ORDERS A
LEFT JOIN
ORDERDETAILS B
ON A.ORDERNUMBER = B.ORDERNUMBER
GROUP BY orderDate

### 월별 매출액

In [7]:
%sql select substr('abcde', 2, 3)

 * mysql://root:***@127.0.0.1:4000/classicmodels
1 rows affected.

[('bcd',)]

In [8]:
%%sql df <<
SELECT substr(a.orderDate, 6, 2) MONTH,SUM((b.`quantityOrdered`*b.`priceEach`)) SALES
FROM orders as a
INNER JOIN orderdetails as b
ON a.`orderNumber` = b.`orderNumber`
GROUP BY MONTH

 * mysql://root:***@127.0.0.1:4000/classicmodels
12 rows affected.
Returning data to local variable df

In [9]:
df

[('01', Decimal('716815.00')),
 ('02', Decimal('735098.65')),
 ('03', Decimal('737920.36')),
 ('04', Decimal('718244.98')),
 ('05', Decimal('869235.79')),
 ('06', Decimal('493841.51')),
 ('07', Decimal('527503.85')),
 ('08', Decimal('597584.20')),
 ('09', Decimal('520497.65')),
 ('10', Decimal('1014570.07')),
 ('11', Decimal('1967317.13')),
 ('12', Decimal('705561.42'))]

### ATV(평균 거래 대금) 구하기

- 전체

In [23]:
%%sql
SELECT sum(b.quantityOrdered*b.priceEach) / count(a.orderNumber) ATV,
sum(b.quantityOrdered*b.priceEach) SALES,
count(a.orderNumber) ORDERNUM
FROM orders as a
INNER JOIN orderdetails as b
ON a.`orderNumber` = b.`orderNumber`

 * mysql://root:***@127.0.0.1:4000/classicmodels
1 rows affected.

[(Decimal('3205.671098'), Decimal('9604190.61'), 2996)]

- 연도별

In [48]:
%%sql
SELECT substr(orderDate, 1, 4) YY  ,
COUNT(DISTINCT(A.orderNumber)) N_PURCHASER,
SUM(quantityOrdered*priceEach) AS SALES,
SUM(quantityOrdered*priceEach) / COUNT(DISTINCT A.customerNumber) ATV
FROM ORDERS A
LEFT JOIN
ORDERDETAILS B
ON A.ORDERNUMBER = B.ORDERNUMBER
GROUP BY YY

 * mysql://root:***@127.0.0.1:4000/classicmodels
3 rows affected.

[('2003', 111, Decimal('3317348.39'), Decimal('44829.032297')),
 ('2004', 151, Decimal('4515905.51'), Decimal('50740.511348')),
 ('2005', 64, Decimal('1770936.71'), Decimal('40248.561591'))]

In [50]:
%%sql df <<
select * from orders

 * mysql://root:***@127.0.0.1:4000/classicmodels
326 rows affected.
Returning data to local variable df

In [51]:
sql_df = df.DataFrame()
sql_df['year'] = sql_df['orderDate'].apply(lambda x : x.year)
sql_df.groupby(['year'])['customerNumber'].count()

year
2003    111
2004    151
2005     64
Name: customerNumber, dtype: int64